In [1]:
import psycopg2
import logging as logger
import pandas as pd
from sqlalchemy import create_engine
from datetime import datetime
from tqdm import tqdm

In [2]:
pd.set_option('display.max_rows', 10)

In [3]:
%load_ext sql

In [4]:
%%sql
postgresql://tenac:password@localhost:5432/moodle

### Download the database and write an SQL script to count

#### The number of tables

In [5]:
%%sql
SELECT count(*) AS TOTALNUMBEROFTABLES
FROM INFORMATION_SCHEMA.TABLES
WHERE TABLE_SCHEMA = 'public'

 * postgresql://tenac:***@localhost:5432/moodle
1 rows affected.

[(448,)]

#### The number of records in each of the tables given in the MIT section

Standard Log

In [6]:
%%sql
SELECT COUNT(*) FROM mdl_logstore_standard_log

 * postgresql://tenac:***@localhost:5432/moodle
1 rows affected.

[(417554,)]

In [7]:
%%sql
SELECT COUNT(*) FROM mdl_modules

 * postgresql://tenac:***@localhost:5432/moodle
1 rows affected.

[(26,)]

In [8]:
%%sql

SELECT COUNT(*)
FROM mdl_user;

 * postgresql://tenac:***@localhost:5432/moodle
1 rows affected.

[(1052,)]

In [9]:
%%sql

SELECT COUNT(*)
FROM mdl_grade_grades;

 * postgresql://tenac:***@localhost:5432/moodle
1 rows affected.

[(3643,)]

In [10]:
%%sql

SELECT COUNT(*)
FROM mdl_modules;

 * postgresql://tenac:***@localhost:5432/moodle
1 rows affected.

[(26,)]

In [11]:
%%sql

SELECT COUNT(*)
FROM mdl_course;

 * postgresql://tenac:***@localhost:5432/moodle
1 rows affected.

[(15,)]

In [12]:
%%sql

SELECT COUNT(*)
FROM mdl_course_modules_completion;

 * postgresql://tenac:***@localhost:5432/moodle
1 rows affected.

[(4483,)]

#### Number of quiz submissions by hour of day

In [13]:
%%sql 
SELECT Extract(HOUR FROM to_timestamp(timecreated)) AS hour, count(*) 
FROM mdl_logstore_standard_log where action='submitted' AND component like '%quiz%' GROUP BY hour;

 * postgresql://tenac:***@localhost:5432/moodle
24 rows affected.

[(0.0, 30),
 (1.0, 29),
 (2.0, 7),
 (3.0, 14),
 (4.0, 10),
 (5.0, 18),
 (6.0, 17),
 (7.0, 34),
 (8.0, 46),
 (9.0, 69),
 (10.0, 95),
 (11.0, 88),
 (12.0, 104),
 (13.0, 90),
 (14.0, 80),
 (15.0, 68),
 (16.0, 68),
 (17.0, 70),
 (18.0, 57),
 (19.0, 55),
 (20.0, 46),
 (21.0, 53),
 (22.0, 26),
 (23.0, 23)]

#### Monthly usage time of learners who have confirmed and are not deleted

In [14]:
%%sql

SELECT COUNT(lastaccess - firstaccess) AS usagetime, 
    EXTRACT (MONTH FROM to_timestamp(firstaccess)) AS month 
        FROM mdl_user 
            WHERE confirmed = 1 AND deleted = 0 
                GROUP BY EXTRACT (MONTH FROM to_timestamp(firstaccess))

 * postgresql://tenac:***@localhost:5432/moodle
7 rows affected.

[(58, 3.0),
 (31, 7.0),
 (450, 1.0),
 (227, 2.0),
 (27, 6.0),
 (140, 4.0),
 (111, 5.0)]

###  Count of log events per user for the following verbs: ['loggedin', 'viewed', 'started', ,'submitted', 'uploaded', 'updated', 'searched', 'resumed', 'answered', 'attempted', 'abandoned']

In [15]:
%%sql 
SELECT userid, COUNT(action) FROM mdl_logstore_standard_log WHERE action = 'loggedin' GROUP BY userid limit 5

 * postgresql://tenac:***@localhost:5432/moodle
5 rows affected.

[(1, 1), (2, 169), (3, 107), (5, 54), (7, 3)]

In [16]:
%%sql 
SELECT userid, COUNT(action) FROM mdl_logstore_standard_log WHERE action = 'viewed' GROUP BY userid limit 5

 * postgresql://tenac:***@localhost:5432/moodle
5 rows affected.

[(0, 5305), (1, 2), (2, 2492), (3, 4041), (5, 694)]

In [17]:
%%sql 
SELECT userid, COUNT(action) FROM mdl_logstore_standard_log WHERE action = 'started' GROUP BY userid limit 5

 * postgresql://tenac:***@localhost:5432/moodle
5 rows affected.

[(2, 14), (3, 17), (5, 11), (7, 2), (8, 1)]

In [18]:
%%sql 
SELECT userid, COUNT(action) FROM mdl_logstore_standard_log WHERE action = 'submitted' GROUP BY userid limit 5

 * postgresql://tenac:***@localhost:5432/moodle
5 rows affected.

[(2, 21), (3, 2), (5, 5), (9, 8), (16, 1)]

In [19]:
%%sql 
SELECT userid, COUNT(action) FROM mdl_logstore_standard_log WHERE action = 'uploaded' GROUP BY userid limit 5

 * postgresql://tenac:***@localhost:5432/moodle
5 rows affected.

[(2, 21), (3, 6), (5, 1), (42, 1), (44, 1)]

In [20]:
%%sql 
SELECT userid, COUNT(action) FROM mdl_logstore_standard_log WHERE action = 'updated' GROUP BY userid limit 5

 * postgresql://tenac:***@localhost:5432/moodle
5 rows affected.

[(0, 649), (2, 2551), (3, 1467), (5, 19), (7, 1)]

In [21]:
%%sql 
SELECT userid, COUNT(action) FROM mdl_logstore_standard_log WHERE action = 'searched' GROUP BY userid limit 5

 * postgresql://tenac:***@localhost:5432/moodle
5 rows affected.

[(84, 2), (246, 1), (253, 1), (266, 2), (294, 1)]

In [22]:
%%sql 
SELECT userid, COUNT(action) FROM mdl_logstore_standard_log WHERE action = 'resumed' GROUP BY userid limit 5

 * postgresql://tenac:***@localhost:5432/moodle
5 rows affected.

[(3, 4), (5, 2), (9, 1), (25, 10), (39, 4)]

In [23]:
%%sql 
SELECT userid, COUNT(action) FROM mdl_logstore_standard_log WHERE action = 'answered' GROUP BY userid limit 5

 * postgresql://tenac:***@localhost:5432/moodle
5 rows affected.

[(5, 2), (9, 4), (25, 6), (38, 1), (39, 1)]

In [24]:
%%sql 
SELECT userid, COUNT(action) FROM mdl_logstore_standard_log WHERE action = 'attempted' GROUP BY userid limit 5

 * postgresql://tenac:***@localhost:5432/moodle
0 rows affected.

[]

In [25]:
%%sql 
SELECT userid, COUNT(action) FROM mdl_logstore_standard_log WHERE action = 'abandoned' GROUP BY userid

 * postgresql://tenac:***@localhost:5432/moodle
1 rows affected.

[(2, 5)]

###  Python Class

In [26]:
import psycopg2
import pandas as pd

# Connection parameters, yours will be different
param_dic = {
    "host"      : "localhost",
    "database"  : "moodle",
    "user"      : "tenac",
    "password"  : "password"
}

In [27]:

def connect(params_dic):
    """ Connect to the PostgreSQL database server """
    conn = None
    try:
        # connect to the PostgreSQL server
        print('Connecting to the PostgreSQL database...')
        conn = psycopg2.connect(**params_dic)
    except (Exception, psycopg2.DatabaseError) as error:
        print(error)
        sys.exit(1) 
    print("Connection successful")
    return conn

def postgresql_to_dataframe(conn,select_query, column_names):
    """
    Tranform a SELECT query into a pandas dataframe
    """
    #db = DBHandler()
    #db.open_local_db()
    cursor = conn.cursor()
    try:
        cursor.execute(select_query)
    except (Exception, psycopg2.DatabaseError) as error:
        print("Error: %s" % error)
        cursor.close()
        return 1

    # Naturally we get a list of tupples
    tupples = cursor.fetchall()
    cursor.close()

    # We just need to turn it into a pandas dataframe
    df = pd.DataFrame(tupples, columns=column_names)
    return df

In [28]:
conn = connect(param_dic)

Connecting to the PostgreSQL database...
Connection successful

#### Overall grade of learners for 10 Academy

In [29]:
column_names = ["User Id", "Overall Grade"]
# Execute the "SELECT *" query
df = postgresql_to_dataframe(conn, "select distinct(userid), finalgrade from mdl_grade_grades Where finalgrade is not null", column_names)
df.head()

   User Id Overall Grade
0      865     781.81818
1      285     100.00000
2      254      30.00000
3      989     100.00000
4     1027      12.00000

#### Number of forum posts

In [30]:
column_names = ["Number of Forum Post"]
# Execute the "SELECT *" query
df = postgresql_to_dataframe(conn, "select COUNT(*) AS total_forum_post from mdl_forum_posts", column_names)
df.head()

   Number of Forum Post
0                   131

## Task 2

### Task 2 - Data Extraction Transformation and Loading (ETL)

>**Based on task 1, write a python class to perform the following**    
 >>Compute dedication time

In [31]:
mdl_logstore =  pd.read_sql("select * from mdl_logstore_standard_log", conn)

In [32]:
#This get the unique userid of each of the training participant
user_id =  mdl_logstore.userid.unique()

d_times = {}

for user in tqdm(user_id):
    """This  loop through the Participant ID and generate all the log for that user 
    after sorting it using the time it was created"""
    user_log = mdl_logstore[mdl_logstore.userid == user].sort_values('timecreated')
    
    d_time = 0 
    isLoggedIn = 0
    loggedIn_timecreated = 0
    total_time = 0
    
    for i in range(len(user_log)):
        """This loop goes over all the logs for a particular user and firstly locate each 
        generate the variable row and next row which is current number the loop is in and the
        next one, the next row is used to check if the next row in the loop is logged in so it
        can calculate the time for the current session, it also makes sure that the time spent isn't more 
        than 7200 second(2 hours) which is the maximum time for a session"""
        row = user_log.iloc[i,]
        row_next = user_log.iloc[i+1,] if i+1 < len(user_log) else row
        #
        
        if(row.action == "loggedin"): 
            isLoggedIn = 1
            loggedIn_timecreated = row.timecreated

        if( (i+1 == len(user_log)) | ( (row_next.action == "loggedin") | (isLoggedIn == 1) ) ):
           
            d_time += min(row.timecreated - loggedIn_timecreated, 7200)
            isLoggedIn = 0 

    d_times[user] = d_time#total_time

100%|██████████| 1049/1049 [03:26<00:00,  5.08it/s]

In [33]:
dedication = pd.DataFrame( {'userid':list(d_times.keys()), 
                                    'dedication_time':list(d_times.values())})

In [34]:
dedication = dedication.sort_values(by=['dedication_time'], ascending=False).reset_index(drop=True)

In [35]:
dedication

      userid  dedication_time
0          2           884875
1        246           516594
2          3           476906
3        290           278372
4        369           245943
...      ...              ...
1044     588             7200
1045     589             7200
1046    1049             7200
1047     391             2880
1048       1               20

[1049 rows x 2 columns]

#### Compute login and activity counts.

> **Login Count**

In [36]:
user_login = mdl_logstore[mdl_logstore.action == 'loggedin'][['userid', 'action']]

user_login_count= user_login.groupby('userid').count().sort_values('action', ascending=False).reset_index()

In [37]:
user_login_count

     userid  action
0         2     169
1       246     113
2         3     107
3       369     100
4       165      91
..      ...     ...
595     603       1
596     609       1
597     612       1
598     614       1
599    1048       1

[600 rows x 2 columns]

> **Activity Count**

In [38]:
user_activity = mdl_logstore[['userid', 'action']]
user_activity_count = user_activity.groupby('userid').count().sort_values('action', ascending=False).reset_index()

In [39]:
user_activity_count

      userid  action
0          2   45023
1        246   13917
2          3   12922
3        917   10696
4        581   10533
...      ...     ...
1044    1033       9
1045     391       7
1046       4       3
1047       1       3
1048     -10       1

[1049 rows x 2 columns]

## Based on the following metrics, group students as top 1%, 5%, 10%, 25%

> **Login count** 
>
> **Activity count** 
>
> **Dedication time**

### Creating a function that would compute the top percentage for each of this activity

In [40]:
def compute_perc(data, percent):
    data = data.iloc[:(int((len(data)*percent)/100)),]
    return data

### Activity Count, Login count and Dedication Time
#### Top 1 %

Activity Count

In [41]:
"""User Activity Count"""
compute_perc(user_activity_count, 1)

   userid  action
0       2   45023
1     246   13917
2       3   12922
3     917   10696
4     581   10533
5     290    8558
6     347    7320
7       0    7257
8     607    6461
9     344    6019

Login Count

In [42]:
"""User Log in Count"""
compute_perc(user_login_count, 1)

   userid  action
0       2     169
1     246     113
2       3     107
3     369     100
4     165      91
5     290      73

Dedication Time

In [43]:
"""User Dedication Time"""
compute_perc(dedication, 1)

   userid  dedication_time
0       2           884875
1     246           516594
2       3           476906
3     290           278372
4     369           245943
5     917           234113
6      45           228394
7     190           217750
8     266           210560
9     344           208012

#### Top 5%

Activity Count

In [44]:
"""User Activity Count"""
compute_perc(user_activity_count, 5)

    userid  action
0        2   45023
1      246   13917
2        3   12922
3      917   10696
4      581   10533
..     ...     ...
47     340    2016
48     842    1980
49     428    1939
50     420    1927
51      98    1910

[52 rows x 2 columns]

Login Count

In [45]:
"""User Log in Count"""
compute_perc(user_login_count, 5)

    userid  action
0        2     169
1      246     113
2        3     107
3      369     100
4      165      91
..     ...     ...
25      50      33
26     286      33
27      48      32
28     294      31
29     284      30

[30 rows x 2 columns]

Dedication Time

In [46]:
"""User Dedication Time"""
compute_perc(dedication, 5)

    userid  dedication_time
0        2           884875
1      246           516594
2        3           476906
3      290           278372
4      369           245943
..     ...              ...
47     865            93056
48     268            91240
49     262            89296
50     381            89163
51     118            89020

[52 rows x 2 columns]

#### Top 10 %

Activity Count

In [47]:
"""User Activity Count"""
compute_perc(user_activity_count, 10)

     userid  action
0         2   45023
1       246   13917
2         3   12922
3       917   10696
4       581   10533
..      ...     ...
99      250     908
100    1019     907
101     301     903
102      51     900
103     759     896

[104 rows x 2 columns]

Login Count

In [48]:
"""User Log in Count"""
compute_perc(user_login_count, 10)

    userid  action
0        2     169
1      246     113
2        3     107
3      369     100
4      165      91
..     ...     ...
55     594      19
56     103      19
57      40      19
58     147      19
59     185      19

[60 rows x 2 columns]

Dedication Time

In [49]:
"""User Dedication Time"""
compute_perc(dedication, 10)

     userid  dedication_time
0         2           884875
1       246           516594
2         3           476906
3       290           278372
4       369           245943
..      ...              ...
99       58            53312
100      43            52963
101     420            52924
102       9            52851
103     180            50632

[104 rows x 2 columns]

#### Top 25 %

Activity Count

In [50]:
"""User Activity Count"""
compute_perc(user_activity_count, 25)

     userid  action
0         2   45023
1       246   13917
2         3   12922
3       917   10696
4       581   10533
..      ...     ...
257     247     130
258      71     128
259     106     128
260     219     126
261     151     126

[262 rows x 2 columns]

Login Count

In [51]:
"""User Log in Count"""
compute_perc(user_login_count, 25)

     userid  action
0         2     169
1       246     113
2         3     107
3       369     100
4       165      91
..      ...     ...
145     445       7
146      77       7
147     348       7
148     267       7
149     287       7

[150 rows x 2 columns]

Dedication Time

In [52]:
"""User Dedication Time"""
compute_perc(dedication, 25)

     userid  dedication_time
0         2           884875
1       246           516594
2         3           476906
3       290           278372
4       369           245943
..      ...              ...
257     315            21600
258     307            21600
259     419            21600
260     318            21600
261     760            21600

[262 rows x 2 columns]